{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "cls_token",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "pad_token",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "eos_token",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "unk_token",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": false,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "cls_token": 0,
      "pad_token": 1,
      "eos_token": 2,
      "unk_token": 3,
      "\"": 4,
      "'": 5,
      "(": 6,
      ")": 7,
      "*": 8,
      "+": 9,
      ",": 10,
      "-": 11,
      ".": 12,
      "/": 13,
      "1": 14,
      "2": 15,
      "3": 16,
      "4": 17,
      "5": 18,
      "7": 19,
      "8": 20,
      "9": 21,
      "<": 22,
      "=": 23,
      "?": 24,
      "@": 25,
      "A": 26,
      "B": 27,
      "C": 28,
      "D": 29,
      "E": 30,
      "F": 31,
      "G": 32,
      "H": 33,
      "I": 34,
      "J": 35,
      "K": 36,
      "L": 37,
      "M": 38,
      "N": 39,
      "O": 40,
      "P": 41,
      "Q": 42,
      "R": 43,
      "S": 44,
      "T": 45,
      "U": 46,
      "V": 47,
      "W": 48,
      "X": 49,
      "Y": 50,
      "Z": 51,
      "[": 52,
      "]": 53,
      "~": 54,
      "¦": 55,
      "¸": 56,
      "¹": 57,
      "Ã": 58,
      "Å": 59,
      "á": 60,
      "â": 61,
      "Ġ": 62,
      "Ģ": 63,
      "ģ": 64,
      "Ĥ": 65,
      "Ħ": 66,
      "Ĩ": 67,
      "ĩ": 68,
      "Ī": 69,
      "ī": 70,
      "ĭ": 71,
      "į": 72,
      "İ": 73,
      "ı": 74,
      "ĳ": 75,
      "Ĵ": 76,
      "ĵ": 77,
      "Ķ": 78,
      "ĸ": 79,
      "ļ": 80,
      "ľ": 81
    },
    "merges": []
  }
}